//Задача 22: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.

int N = Convert.ToInt32(Console.WriteLine());
while (N<0)
